{"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "input_22", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_22"}, "inbound_nodes": []}, {"name": "block1_conv1", "class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": true, "filters": 10, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_22", 0, 0, {}]]]}, {"name": "dropout_14", "class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "max_pooling2d_10", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}, {"name": "flatten_8", "class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_8", 0, 0, {}]]]}, {"name": "dense_16", "class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_15", 0, 0, {}]]]}], "input_layers": [["input_22", 0, 0]], "output_layers": [["dense_16", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}